# LiningType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..LiningType Property
FabricationPart Class See Also
---
The lining type of the fabrication part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public string LiningType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property LiningType As String
	Get
```

Visual C++
---
```text
public:
property String^ LiningType {
	String^ get ();
}
```

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace